---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateShortenCutstraight
source: html/683a5f44-3a72-d6e5-f406-43d3a880c8b7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateShortenCutstraight Property

"Cut straight"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPlateShortenCutstraight { get; }
```